emacs/init.org
#+auto_tangle: y

* Some init setup

#+begin_src emacs-lisp :tangle yes
  ;; -*- lexical-binding: t; -*-

  (toggle-debug-on-error)
  ;; use C-x r j i to quick jump to this file
  (set-register ?i (cons 'file "~/src/dotfiles/emacs/init.el"))
#+end_src

* Configure Straight

#+begin_src emacs-lisp :tangle yes
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (setq package-enable-at-startup nil)

  ;; install use-package
  (straight-use-package 'use-package)

  ;; attempt to force using straight for org
  (straight-use-package 'org)
#+end_src
* Everything Else


#+begin_src emacs-lisp :tangle yes
